Model: "Model2"
__________________________________________________________________________________________________
 Layer (type)                   Output Shape         Param #     Connected to                     
==================================================================================================
 input_1 (InputLayer)           [(16, 5, 32, 64, 5)  0           []                               
                                ]                                                                 
                                                                                                  
 layer_1 (Conv3D)               (16, 5, 32, 64, 64)  24064       ['input_1[0][0]']                
                                                                                                  
 bn_1 (BatchNormalization)      (16, 5, 32, 64, 64)  256         ['layer_1[0][0]']                
                                                                                                  
 zero_padding3d (ZeroPadding3D)  (16, 7, 34, 66, 64)  0          ['bn_1[0][0]']                   
                                                                                                  
 layer_2 (Conv3D)               (16, 5, 16, 32, 128  393344      ['zero_padding3d[0][0]']         
                                )                                                                 
                                                                                                  
 bn_2 (BatchNormalization)      (16, 5, 16, 32, 128  512         ['layer_2[0][0]']                
                                )                                                                 
                                                                                                  
 layer_3 (Conv3D)               (16, 5, 16, 32, 128  442496      ['bn_2[0][0]']                   
                                )                                                                 
                                                                                                  
 bn_3 (BatchNormalization)      (16, 5, 16, 32, 128  512         ['layer_3[0][0]']                
                                )                                                                 
                                                                                                  
 zero_padding3d_1 (ZeroPadding3  (16, 7, 18, 34, 128  0          ['bn_3[0][0]']                   
 D)                             )                                                                 
                                                                                                  
 comb_layer_4 (Conv3D)          (16, 5, 8, 16, 256)  884992      ['zero_padding3d_1[0][0]']       
                                                                                                  
 comb_bn_4 (BatchNormalization)  (16, 5, 8, 16, 256)  1024       ['comb_layer_4[0][0]']           
                                                                                                  
 layer_5 (Conv3D)               (16, 5, 8, 16, 256)  1769728     ['comb_bn_4[0][0]']              
                                                                                                  
 bn_5 (BatchNormalization)      (16, 5, 8, 16, 256)  1024        ['layer_5[0][0]']                
                                                                                                  
 layer_6 (Conv3D)               (16, 5, 8, 16, 256)  1769728     ['bn_5[0][0]']                   
                                                                                                  
 bn_6 (BatchNormalization)      (16, 5, 8, 16, 256)  1024        ['layer_6[0][0]']                
                                                                                                  
 layer_7 (Conv3D)               (16, 5, 8, 16, 256)  1769728     ['bn_6[0][0]']                   
                                                                                                  
 bn_7 (BatchNormalization)      (16, 5, 8, 16, 256)  1024        ['layer_7[0][0]']                
                                                                                                  
 layer_8 (Conv3D)               (16, 5, 8, 16, 256)  1769728     ['bn_7[0][0]']                   
                                                                                                  
 bn_8 (BatchNormalization)      (16, 5, 8, 16, 256)  1024        ['layer_8[0][0]']                
                                                                                                  
 layer_9 (Conv3D)               (16, 5, 8, 16, 256)  1769728     ['bn_8[0][0]']                   
                                                                                                  
 bn_9 (BatchNormalization)      (16, 5, 8, 16, 256)  1024        ['layer_9[0][0]']                
                                                                                                  
 concatenate (Concatenate)      (16, 5, 8, 16, 512)  0           ['bn_7[0][0]',                   
                                                                  'bn_9[0][0]']                   
                                                                                                  
 layer_10 (Conv3D)              (16, 5, 8, 16, 256)  3539200     ['concatenate[0][0]']            
                                                                                                  
 bn_10 (BatchNormalization)     (16, 5, 8, 16, 256)  1024        ['layer_10[0][0]']               
                                                                                                  
 concatenate_1 (Concatenate)    (16, 5, 8, 16, 512)  0           ['bn_6[0][0]',                   
                                                                  'bn_10[0][0]']                  
                                                                                                  
 layer_11 (Conv3D)              (16, 5, 8, 16, 256)  3539200     ['concatenate_1[0][0]']          
                                                                                                  
 bn_11 (BatchNormalization)     (16, 5, 8, 16, 256)  1024        ['layer_11[0][0]']               
                                                                                                  
 concatenate_2 (Concatenate)    (16, 5, 8, 16, 512)  0           ['bn_5[0][0]',                   
                                                                  'bn_11[0][0]']                  
                                                                                                  
 layer_12 (Conv3D)              (16, 5, 8, 16, 256)  3539200     ['concatenate_2[0][0]']          
                                                                                                  
 bn_12 (BatchNormalization)     (16, 5, 8, 16, 256)  1024        ['layer_12[0][0]']               
                                                                                                  
 concatenate_3 (Concatenate)    (16, 5, 8, 16, 512)  0           ['comb_bn_4[0][0]',              
                                                                  'bn_12[0][0]']                  
                                                                                                  
 layer_13 (Conv3DTranspose)     (16, 5, 17, 33, 128  589952      ['concatenate_3[0][0]']          
                                )                                                                 
                                                                                                  
 crop_13 (Cropping3D)           (16, 5, 16, 32, 128  0           ['layer_13[0][0]']               
                                )                                                                 
                                                                                                  
 bn_13 (BatchNormalization)     (16, 5, 16, 32, 128  512         ['crop_13[0][0]']                
                                )                                                                 
                                                                                                  
 concatenate_4 (Concatenate)    (16, 5, 16, 32, 256  0           ['bn_3[0][0]',                   
                                )                                 'bn_13[0][0]']                  
                                                                                                  
 layer_14 (Conv3D)              (16, 5, 16, 32, 128  884864      ['concatenate_4[0][0]']          
                                )                                                                 
                                                                                                  
 bn_14 (BatchNormalization)     (16, 5, 16, 32, 128  512         ['layer_14[0][0]']               
                                )                                                                 
                                                                                                  
 concatenate_5 (Concatenate)    (16, 5, 16, 32, 256  0           ['bn_2[0][0]',                   
                                )                                 'bn_14[0][0]']                  
                                                                                                  
 layer_15 (Conv3DTranspose)     (16, 5, 33, 65, 64)  147520      ['concatenate_5[0][0]']          
                                                                                                  
 crop_15 (Cropping3D)           (16, 5, 32, 64, 64)  0           ['layer_15[0][0]']               
                                                                                                  
 bn_15 (BatchNormalization)     (16, 5, 32, 64, 64)  256         ['crop_15[0][0]']                
                                                                                                  
 concatenate_6 (Concatenate)    (16, 5, 32, 64, 128  0           ['bn_1[0][0]',                   
                                )                                 'bn_15[0][0]']                  
                                                                                                  
 layer_16 (Conv3D)              (16, 5, 32, 64, 32)  110624      ['concatenate_6[0][0]']          
                                                                                                  
 bn_16 (BatchNormalization)     (16, 5, 32, 64, 32)  128         ['layer_16[0][0]']               
                                                                                                  
 layer_17 (Conv3D)              (16, 5, 32, 64, 2)   1730        ['bn_16[0][0]']                  
                                                                                                  
==================================================================================================
Total params: 22,957,740
Trainable params: 22,951,778
Non-trainable params: 5,962
__________________________________________________________________________________________________